---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainerItem.TotalLength
source: html/9c3cc4f9-47b9-994c-a8b6-a06524558daf.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.TotalLength Property

The length of an individual bar multiplied by Quantity.

## Syntax (C#)
```csharp
public double TotalLength { get; }
```